js216/stm32mp135-bootloader/src/fmc.c
// SPDX-License-Identifier: BSD-3-Clause

/**
 * @file fmc.c
 * @brief FMC NAND management
 * @author Jakob Kastelic
 * @copyright 2026 Stanford Research Systems, Inc.
 */

#include <stddef.h>
#include <stdint.h>
#include <string.h>
#include "board.h"
#include "defaults.h"
#include "fmc.h"
#include "nand_pt.h"

#ifdef NAND_FLASH

#include "irq_ctrl.h"
#include "prng.h"
#include "printf.h"
#include "stm32mp135fxx_ca7.h"
#include "stm32mp13xx_hal.h"
#include "stm32mp13xx_hal_def.h"
#include "stm32mp13xx_hal_gpio.h"
#include "stm32mp13xx_hal_gpio_ex.h"
#include "stm32mp13xx_hal_nand.h"
#include "stm32mp13xx_hal_rcc.h"
#include "stm32mp13xx_ll_fmc.h"

#define BLOCK_BYTES  (FMC_BLOCK_SIZE_PAGES * FMC_PAGE_SIZE_BYTES)
#define BUF_A_ADDR   (FMC_SCRATCH_ADDR)
#define BUF_B_ADDR   (FMC_SCRATCH_ADDR + BLOCK_BYTES)
#define TEST_SEED    UINT64_C(0xCAFEBABEDEADBEEF)

static NAND_HandleTypeDef hnand;
static int                nand_ready = 0;

/* Two DDR scratch buffers, each one full NAND block (256 KB). */
static uint8_t * const buf_a = (uint8_t *)BUF_A_ADDR;
static uint8_t * const buf_b = (uint8_t *)BUF_B_ADDR;

/* Bad block table: 1 = bad, 0 = good.  Populated by fmc_init OOB scan. */
static uint8_t bad[FMC_PLANE_NBR * FMC_PLANE_SIZE_BLOCKS];

volatile int fmc_flush_active = 0;

static inline void setupgpio(GPIO_TypeDef *gpio, GPIO_InitTypeDef *init,
                              uint32_t pin)
{
   init->Pin = pin;
   HAL_GPIO_Init(gpio, init);
}

static inline NAND_AddressTypeDef page_addr(uint32_t blk, uint32_t pg)
{
   NAND_AddressTypeDef a;
   a.Page  = (uint16_t)pg;
   a.Block = (uint16_t)(blk % hnand.Config.PlaneSize);
   a.Plane = (uint16_t)(blk / hnand.Config.PlaneSize);
   return a;
}


static HAL_StatusTypeDef read_page(uint32_t blk, uint32_t pg, uint8_t *buf)
{
   NAND_AddressTypeDef a = page_addr(blk, pg);
   uint32_t n;
   if (HAL_NAND_ECC_Read_Page_8b(&hnand, &a, buf, 1, &n) != HAL_OK)
      return HAL_ERROR;
   return HAL_OK;
}

static HAL_StatusTypeDef write_page(uint32_t blk, uint32_t pg,
                                    const uint8_t *buf)
{
   NAND_AddressTypeDef a = page_addr(blk, pg);
   uint32_t n = 0;
   return HAL_NAND_ECC_Write_Page_8b(&hnand, &a, (uint8_t *)buf, 1, &n);
}

static HAL_StatusTypeDef erase_block(uint32_t blk)
{
   NAND_AddressTypeDef a = page_addr(blk, 0);
   return HAL_NAND_Erase_Block(&hnand, &a);
}

static int is_bad_oob(uint32_t blk)
{
   uint8_t oob[FMC_OOB_SIZE_BYTES];
   NAND_AddressTypeDef a = page_addr(blk, 0);
   if (HAL_NAND_Read_SpareArea_8b(&hnand, &a, oob, 1) != HAL_OK)
      return 1;
   if (oob[0] != 0xFFU)
      return 1;
   a = page_addr(blk, 1);
   if (HAL_NAND_Read_SpareArea_8b(&hnand, &a, oob, 1) != HAL_OK)
      return 1;
   return oob[0] != 0xFFU;
}

static void mark_bad_oob(uint32_t blk)
{
   uint8_t oob[FMC_OOB_SIZE_BYTES];
   memset(oob, 0xFFU, sizeof(oob));
   oob[0] = 0x00U;
   NAND_AddressTypeDef a = page_addr(blk, 0);
   HAL_NAND_Write_SpareArea_8b(&hnand, &a, oob, 1);
   a = page_addr(blk, 1);
   HAL_NAND_Write_SpareArea_8b(&hnand, &a, oob, 1);
}

static uint32_t lba_to_phys_block(uint32_t good_idx)
{
   const uint32_t total = hnand.Config.PlaneNbr * hnand.Config.PlaneSize;
   uint32_t good = 0;
   for (uint32_t b = 0; b < total; b++) {
      if (!bad[b]) {
         if (good == good_idx)
            return b;
         good++;
      }
   }
   return UINT32_MAX;
}

static HAL_StatusTypeDef read_block(uint32_t blk, uint8_t *buf)
{
   NAND_AddressTypeDef a = page_addr(blk, 0);
   uint32_t n;
   return HAL_NAND_ECC_Read_Page_8b(&hnand, &a, buf, hnand.Config.BlockSize, &n);
}

static HAL_StatusTypeDef write_block(uint32_t blk, const uint8_t *buf)
{
   for (uint32_t pg = 0; pg < hnand.Config.BlockSize; pg++)
      if (write_page(blk, pg, buf + pg * hnand.Config.PageSize) != HAL_OK)
         return HAL_ERROR;
   return HAL_OK;
}

static inline uint32_t le32(const uint8_t *p, uint32_t o)
{
   return (uint32_t)p[o]         | ((uint32_t)p[o+1] <<  8) |
          ((uint32_t)p[o+2] << 16) | ((uint32_t)p[o+3] << 24);
}

static inline uint32_t popcount8(uint8_t x)
{
   x = x - ((x >> 1U) & 0x55U);
   x = (x & 0x33U) + ((x >> 2U) & 0x33U);
   return (uint32_t)((x + (x >> 4U)) & 0x0FU);
}

static void print_mbs(uint32_t bytes, uint32_t elapsed_ms)
{
   if (elapsed_ms == 0U)
      return;
   const uint32_t x10 = (uint32_t)(((uint64_t)bytes * 10000ULL) /
                                    ((uint64_t)elapsed_ms * 1048576ULL));
   my_printf("%lu.%lu MB/s",
             (unsigned long)(x10 / 10U), (unsigned long)(x10 % 10U));
}

void fmc_init(int argc, uint32_t arg1, uint32_t arg2, uint32_t arg3)
{
   (void)argc; (void)arg1; (void)arg2; (void)arg3;

   __HAL_RCC_FMC_CLK_ENABLE();
   __HAL_RCC_FMC_FORCE_RESET();
   __HAL_RCC_FMC_RELEASE_RESET();
   __HAL_RCC_MDMA_CLK_ENABLE();

   __HAL_RCC_GPIOA_CLK_ENABLE();
   __HAL_RCC_GPIOB_CLK_ENABLE();
   __HAL_RCC_GPIOD_CLK_ENABLE();
   __HAL_RCC_GPIOE_CLK_ENABLE();
   __HAL_RCC_GPIOG_CLK_ENABLE();

   GPIO_InitTypeDef g = {
      .Mode      = GPIO_MODE_AF_PP,
      .Pull      = GPIO_PULLUP,
      .Speed     = GPIO_SPEED_FREQ_VERY_HIGH,
      .Alternate = GPIO_AF10_FMC,
   };
   setupgpio(GPIOA, &g, GPIO_PIN_9);  /* FMC_NWAIT */
   g.Alternate = GPIO_AF12_FMC;
   setupgpio(GPIOG, &g, GPIO_PIN_9);  /* FMC_NCE  */
   setupgpio(GPIOD, &g, GPIO_PIN_4);  /* FMC_NOE  */
   setupgpio(GPIOD, &g, GPIO_PIN_5);  /* FMC_NWE  */
   setupgpio(GPIOD, &g, GPIO_PIN_12); /* FMC_ALE  */
   setupgpio(GPIOD, &g, GPIO_PIN_11); /* FMC_CLE  */
   setupgpio(GPIOD, &g, GPIO_PIN_14); /* FMC_D0   */
   setupgpio(GPIOD, &g, GPIO_PIN_15); /* FMC_D1   */
   setupgpio(GPIOD, &g, GPIO_PIN_0);  /* FMC_D2   */
   setupgpio(GPIOD, &g, GPIO_PIN_1);  /* FMC_D3   */
   setupgpio(GPIOE, &g, GPIO_PIN_7);  /* FMC_D4   */
   setupgpio(GPIOE, &g, GPIO_PIN_8);  /* FMC_D5   */
   setupgpio(GPIOE, &g, GPIO_PIN_9);  /* FMC_D6   */
   setupgpio(GPIOE, &g, GPIO_PIN_10); /* FMC_D7   */

   IRQ_SetPriority(FMC_IRQn, 0x0F);
   IRQ_Enable(FMC_IRQn);

   hnand.Instance                  = FMC_NAND_DEVICE;
   hnand.Init.NandBank             = FMC_NAND_BANK3;
   hnand.Init.Waitfeature          = FMC_NAND_WAIT_FEATURE_ENABLE;
   hnand.Init.MemoryDataWidth      = FMC_NAND_MEM_BUS_WIDTH_8;
   hnand.Init.EccComputation       = FMC_NAND_ECC_DISABLE;
   hnand.Init.EccAlgorithm         = FMC_NAND_ECC_ALGO_BCH;
   hnand.Init.BCHMode              = FMC_NAND_BCH_8BIT;
   hnand.Init.EccSectorSize        = FMC_NAND_ECC_SECTOR_SIZE_512BYTE;
   hnand.Init.TCLRSetupTime        = 2;
   hnand.Init.TARSetupTime         = 2;
   hnand.Config.PageSize           = FMC_PAGE_SIZE_BYTES;
   hnand.Config.SpareAreaSize      = FMC_OOB_SIZE_BYTES;
   hnand.Config.BlockSize          = FMC_BLOCK_SIZE_PAGES;
   hnand.Config.BlockNbr           = FMC_PLANE_NBR * FMC_PLANE_SIZE_BLOCKS;
   hnand.Config.PlaneSize          = FMC_PLANE_SIZE_BLOCKS;
   hnand.Config.PlaneNbr           = FMC_PLANE_NBR;
   hnand.Config.ExtraCommandEnable = 1;

   FMC_NAND_PCC_TimingTypeDef com = {
      .SetupTime = 0x01, .WaitSetupTime = 0x07,
      .HoldSetupTime = 0x02, .HiZSetupTime = 0x01,
   };
   FMC_NAND_PCC_TimingTypeDef att = {
      .SetupTime = 0x1A, .WaitSetupTime = 0x07,
      .HoldSetupTime = 0x6A, .HiZSetupTime = 0x01,
   };

   if (HAL_NAND_Init(&hnand, &com, &att) != HAL_OK) {
      my_printf("HAL_NAND_Init failed\r\n");
      return;
   }

