js216/stm32mp135-bootloader/src/fmc.c
   NAND_EccConfigTypeDef ecc = { .Offset = 2 };
   if (HAL_NAND_ECC_Init(&hnand, &ecc) != HAL_OK) {
      my_printf("HAL_NAND_ECC_Init failed\r\n");
      return;
   }

   if (HAL_NAND_Reset(&hnand) != HAL_OK) {
      my_printf("HAL_NAND_Reset failed\r\n");
      return;
   }

   NAND_IDTypeDef id = {0};
   if (HAL_NAND_Read_ID(&hnand, &id) != HAL_OK) {
      my_printf("HAL_NAND_Read_ID failed\r\n");
      return;
   }

   if (id.Maker_Id != FMC_MAKER || id.Device_Id != FMC_DEV ||
       id.Third_Id != FMC_3RD   || id.Fourth_Id != FMC_4TH) {
      my_printf("unexpected NAND ID: %02x %02x %02x %02x\r\n",
                id.Maker_Id, id.Device_Id, id.Third_Id, id.Fourth_Id);
      return;
   }

   nand_ready = 1;
   fmc_scan(0, 0, 0, 0);
}

/* USB MSC: lba in pages; read_page/write_page used directly because
 * block-level helpers would read 256 KB per 4 KB USB request. */
HAL_StatusTypeDef fmc_read_blocks(uint8_t *buf, uint32_t lba, uint32_t n)
{
   if (!nand_ready)
      return HAL_ERROR;
   const uint32_t ppb = hnand.Config.BlockSize;
   for (uint32_t i = 0; i < n; i++) {
      const uint32_t ap   = lba + i;
      const uint32_t phys = lba_to_phys_block(ap / ppb);
      if (phys == UINT32_MAX)
         return HAL_ERROR;
      if (read_page(phys, ap % ppb, buf + i * hnand.Config.PageSize) != HAL_OK)
         return HAL_ERROR;
   }
   return HAL_OK;
}

HAL_StatusTypeDef fmc_write_blocks(const uint8_t *buf, uint32_t lba, uint32_t n)
{
   if (!nand_ready)
      return HAL_ERROR;
   const uint32_t ppb = hnand.Config.BlockSize;
   for (uint32_t i = 0; i < n; i++) {
      const uint32_t ap   = lba + i;
      const uint32_t phys = lba_to_phys_block(ap / ppb);
      if (phys == UINT32_MAX)
         return HAL_ERROR;
      if (write_page(phys, ap % ppb, buf + i * hnand.Config.PageSize) != HAL_OK)
         return HAL_ERROR;
   }
   return HAL_OK;
}

uint32_t fmc_block_count(void)
{
   if (!nand_ready)
      return 0;
   const uint32_t total = hnand.Config.PlaneNbr * hnand.Config.PlaneSize;
   uint32_t good = 0;
   for (uint32_t b = 0; b < total; b++)
      if (!bad[b])
         good++;
   return good * hnand.Config.BlockSize;
}

void fmc_erase_all(int argc, uint32_t arg1, uint32_t arg2, uint32_t arg3)
{
   (void)argc; (void)arg1; (void)arg2; (void)arg3;
   if (!nand_ready) { my_printf("FMC: not initialised\r\n"); return; }

   const uint32_t total   = hnand.Config.PlaneNbr * hnand.Config.PlaneSize;
   const uint32_t n       = (argc >= 1 && arg1 > 0 && arg1 <= total) ? arg1 : total;
   uint32_t       pre     = 0;
   uint32_t       new_bad = 0;
   const uint32_t t0      = HAL_GetTick();
   uint32_t       t_print = t0;

   my_printf("FMC: erasing %lu blocks\r\n", n);
   for (uint32_t blk = 0; blk < n; blk++) {
      if (bad[blk]) {
         my_printf("\rskip %lu (pre-marked bad)\r\n", blk);
         pre++;
         continue;
      }
      if (erase_block(blk) != HAL_OK) {
         my_printf("\rnewly bad %lu (erase fail)\r\n", blk);
         mark_bad_oob(blk);
         bad[blk] = 1;
         new_bad++;
      }
      const uint32_t now = HAL_GetTick();
      if ((now - t_print) >= 2000U) {
         my_printf("\rblk %lu/%lu  (%lu pre-bad, %lu new-bad)  ",
                   blk + 1, n, pre, new_bad);
         print_mbs((blk + 1) * BLOCK_BYTES, now - t0);
         t_print = now;
      }
   }
   const uint32_t elapsed = HAL_GetTick() - t0;
   my_printf("\r\ndone: %lu pre-marked bad, %lu newly bad, %lu s, avg ",
             pre, new_bad, elapsed / 1000U);
   print_mbs(n * BLOCK_BYTES, elapsed);
   my_printf("\r\n");
}

static void check_boot_block(uint32_t blk)
{
   my_printf("boot check: block %lu\r\n", blk);
   if (read_block(blk, buf_a) != HAL_OK) {
      my_printf("  read error\r\n");
      return;
   }

   const uint8_t *h = buf_a;
   if (h[0] != 'S' || h[1] != 'T' || h[2] != 'M' || h[3] != 0x32) {
      my_printf("  bad magic: %02x %02x %02x %02x\r\n",
                h[0], h[1], h[2], h[3]);
      return;
   }

   const uint32_t checksum  = le32(h, 0x44);
   const uint32_t ver_word  = le32(h, 0x48);
   const uint32_t image_len = le32(h, 0x4C);
   const uint32_t entry_pt  = le32(h, 0x50);
   const uint32_t load_addr = le32(h, 0x58);
   const uint8_t  major     = (uint8_t)(ver_word >> 16);
   const uint8_t  minor     = (uint8_t)(ver_word >>  8);

   my_printf("  version %u.%u  image_len %lu  entry 0x%08lx  load 0x%08lx\r\n",
             major, minor, image_len, entry_pt, load_addr);

   if (image_len == 0) { my_printf("  zero image_len\r\n"); return; }

   if (major == 2) {
      const uint8_t *e = h + 0x80;
      if (e[0] == 'S' && e[1] == 'T' && e[2] == 0xFF && e[3] == 0xFF)
         my_printf("  ext header: OK\r\n");
      else
         my_printf("  ext header: bad %02x %02x %02x %02x\r\n",
                   e[0], e[1], e[2], e[3]);
   }

   /* Checksum over image_len bytes starting at byte 512 (after header).
    * Reads block-by-block into buf_a; handles images spanning multiple blocks. */
   uint32_t computed  = 0;
   uint32_t remaining = image_len;
   uint32_t cur_blk   = blk;
   uint32_t byte_off  = 512U;

   while (remaining > 0) {
      if (cur_blk != blk && read_block(cur_blk, buf_a) != HAL_OK) {
         my_printf("  read error at block %lu\r\n", cur_blk);
         return;
      }
      const uint32_t avail = BLOCK_BYTES - byte_off;
      const uint32_t use   = remaining < avail ? remaining : avail;
      for (uint32_t i = byte_off; i < byte_off + use; i++)
         computed += buf_a[i];
      remaining -= use;
      byte_off   = 0;
      cur_blk++;
   }

   if (computed == checksum)
      my_printf("  checksum OK (0x%08lx)\r\n", computed);
   else
      my_printf("  checksum MISMATCH computed 0x%08lx stored 0x%08lx\r\n",
                computed, checksum);
}

static void check_partition_table(void)
{
   my_printf("partition table: block %u\r\n", NAND_BLOCK_PT);
   if (read_block(NAND_BLOCK_PT, buf_a) != HAL_OK) {
      my_printf("  read error\r\n");
      return;
   }
   const nand_pt_t *pt = (const nand_pt_t *)buf_a;
   if (pt->magic != NAND_PT_MAGIC) {
      my_printf("  bad magic: 0x%08lx\r\n", (unsigned long)pt->magic);
      return;
   }
   if (pt->version != NAND_PT_VERSION) {
      my_printf("  unknown version: %lu\r\n", (unsigned long)pt->version);
      return;
   }
   uint32_t sum = 0;
   const uint8_t *b = (const uint8_t *)pt;
   for (uint32_t i = 0; i < (uint32_t)offsetof(nand_pt_t, checksum); i++)
      sum += b[i];
   if (sum != pt->checksum) {
      my_printf("  checksum MISMATCH computed 0x%08lx stored 0x%08lx\r\n",
                (unsigned long)sum, (unsigned long)pt->checksum);
      return;
   }
   my_printf("  checksum OK  total_blocks %lu  %lu partition(s)\r\n",
             (unsigned long)pt->total_blocks, (unsigned long)pt->num_parts);
   for (uint32_t i = 0; i < pt->num_parts && i < NAND_PT_MAX_PARTS; i++) {
      const nand_part_t *p = &pt->parts[i];
      my_printf("  [%lu] %-16s  block %lu  len %lu\r\n",
                (unsigned long)i, p->name,
                (unsigned long)p->start_block, (unsigned long)p->num_blocks);
   }
}

static void check_dtb(void)
{
   my_printf("DTB: block %u\r\n", NAND_BLOCK_DTB);
   if (read_block(NAND_BLOCK_DTB, buf_a) != HAL_OK) {
      my_printf("  read error\r\n");
      return;
   }
   /* FDT magic: 0xD00DFEED big-endian */
   const uint8_t *h = buf_a;
   const uint32_t magic = ((uint32_t)h[0] << 24) | ((uint32_t)h[1] << 16) |
                          ((uint32_t)h[2] <<  8) |  (uint32_t)h[3];
   if (magic != 0xD00DFEEDU) {
      my_printf("  bad FDT magic: 0x%08lx\r\n", (unsigned long)magic);
      return;
   }
   const uint32_t totalsize = ((uint32_t)h[4] << 24) | ((uint32_t)h[5] << 16) |
                              ((uint32_t)h[6] <<  8) |  (uint32_t)h[7];
   my_printf("  FDT magic OK  totalsize %lu bytes\r\n", (unsigned long)totalsize);
}

