js216/stm32mp135-bootloader/src/fmc.c
void fmc_test_boot(int argc, uint32_t arg1, uint32_t arg2, uint32_t arg3)
{
   (void)argc; (void)arg1; (void)arg2; (void)arg3;
   if (!nand_ready) { my_printf("FMC: not initialised\r\n"); return; }
   check_boot_block(0);
   check_boot_block(1);
   check_partition_table();
   check_dtb();
}

void fmc_test_write(int argc, uint32_t arg1, uint32_t arg2, uint32_t arg3)
{
   (void)argc; (void)arg1; (void)arg2; (void)arg3;
   if (!nand_ready) { my_printf("FMC: not initialised\r\n"); return; }

   const uint32_t n  = hnand.Config.PlaneNbr * hnand.Config.PlaneSize;
   uint64_t       prng     = TEST_SEED;
   uint32_t       errors   = 0;
   const uint32_t t0       = HAL_GetTick();
   uint32_t       t_print  = t0;

   my_printf("FMC write: %lu blocks\r\n", n);
   for (uint32_t blk = 0; blk < n; blk++) {
      prng_fill(buf_a, BLOCK_BYTES, &prng);
      if (write_block(blk, buf_a) != HAL_OK)
         errors++;
      const uint32_t now = HAL_GetTick();
      if ((now - t_print) >= 2000U) {
         my_printf("\rblk %lu/%lu  ", blk + 1, n);
         print_mbs((blk + 1) * BLOCK_BYTES, now - t0);
         my_printf("  (%lu errs)  ", errors);
         t_print = now;
      }
   }
   const uint32_t elapsed = HAL_GetTick() - t0;
   my_printf("\r\ndone: %lu errs, %lu s, avg ", errors, elapsed / 1000U);
   print_mbs(n * BLOCK_BYTES, elapsed);
   my_printf("\r\n");
}

void fmc_test_read(int argc, uint32_t arg1, uint32_t arg2, uint32_t arg3)
{
   (void)argc; (void)arg1; (void)arg2; (void)arg3;
   if (!nand_ready) { my_printf("FMC: not initialised\r\n"); return; }

   const uint32_t n  = hnand.Config.PlaneNbr * hnand.Config.PlaneSize;
   uint64_t       prng     = TEST_SEED;
   uint32_t       bit_errs = 0;
   uint32_t       rd_errs  = 0;
   const uint32_t t0       = HAL_GetTick();
   uint32_t       t_print  = t0;

   my_printf("FMC read: %lu blocks\r\n", n);
   for (uint32_t blk = 0; blk < n; blk++) {
      prng_fill(buf_a, BLOCK_BYTES, &prng);
      if (read_block(blk, buf_b) != HAL_OK) {
         rd_errs++;
         continue;
      }
      for (uint32_t i = 0; i < BLOCK_BYTES; i++) {
         const uint8_t diff = buf_b[i] ^ buf_a[i];
         if (diff)
            bit_errs += popcount8(diff);
      }
      const uint32_t now = HAL_GetTick();
      if ((now - t_print) >= 2000U) {
         my_printf("\rblk %lu/%lu  ", blk + 1, n);
         print_mbs((blk + 1) * BLOCK_BYTES, now - t0);
         my_printf("  (%lu bit errs)  ", bit_errs);
         t_print = now;
      }
   }
   const uint32_t elapsed = HAL_GetTick() - t0;
   my_printf("\r\ndone: %lu rd errs, %lu bit errs (post-ECC), %lu s, avg ",
             rd_errs, bit_errs, elapsed / 1000U);
   print_mbs(n * BLOCK_BYTES, elapsed);
   my_printf("\r\n");
}


void fmc_scan(int argc, uint32_t arg1, uint32_t arg2, uint32_t arg3)
{
   (void)argc; (void)arg1; (void)arg2; (void)arg3;
   if (!nand_ready) { my_printf("FMC: not initialised\r\n"); return; }

   const uint32_t total = hnand.Config.PlaneNbr * hnand.Config.PlaneSize;
   uint32_t count = 0;
   for (uint32_t blk = 0; blk < total; blk++) {
      const int b = is_bad_oob(blk);
      bad[blk] = (uint8_t)b;
      if (b) {
         my_printf("bad: blk %lu\r\n", blk);
         count++;
      }
   }
   my_printf("scan done: %lu bad / %lu total\r\n", count, total);
}

static uint32_t pt_total_blocks(void)
{
   const nand_pt_t * const pt = (const nand_pt_t *)(
      FMC_DDR_BUF_ADDR + (uint32_t)(NAND_BLOCK_PT * BLOCK_BYTES));
   if (pt->magic != NAND_PT_MAGIC)
      return 0;
   uint32_t sum = 0;
   const uint8_t *b = (const uint8_t *)pt;
   for (uint32_t i = 0; i < (uint32_t)offsetof(nand_pt_t, checksum); i++)
      sum += b[i];
   if (sum != pt->checksum)
      return 0;
   return pt->total_blocks;
}

void fmc_flush(int argc, uint32_t arg1, uint32_t arg2, uint32_t arg3)
{
   (void)arg2; (void)arg3;
   if (!nand_ready) { my_printf("FMC: not initialised\r\n"); return; }

   const uint32_t ppb      = hnand.Config.BlockSize;
   const uint32_t total    = hnand.Config.PlaneNbr * hnand.Config.PlaneSize;
   const uint32_t max_blks = FMC_DDR_BUF_SIZE / BLOCK_BYTES;
   const uint32_t pt_n     = pt_total_blocks();
   const uint32_t n        = (argc >= 1 && arg1 > 0 && arg1 <= max_blks) ? arg1 :
                             (pt_n > 0 && pt_n <= max_blks)               ? pt_n :
                             max_blks;
   const uint8_t * const ddr = (const uint8_t *)FMC_DDR_BUF_ADDR;

   fmc_flush_active = 1;

   uint32_t written  = 0;
   uint32_t skipped  = 0;
   uint32_t bad_new  = 0;
   uint32_t good_idx = 0;
   uint32_t phys     = 0;
   const uint32_t t0 = HAL_GetTick();
   uint32_t t_print  = t0;

   my_printf("FMC flush: %lu blocks\r\n", n);

   while (good_idx < n && phys < total) {
      if (bad[phys]) { phys++; continue; }

      const uint8_t * const src = ddr + good_idx * BLOCK_BYTES;
      int advance = 1;

      /* Skip if NAND block already matches DDR. */
      int match = (read_block(phys, buf_a) == HAL_OK) &&
                  (memcmp(buf_a, src, BLOCK_BYTES) == 0);

      if (match) {
         skipped++;
      } else if (erase_block(phys) != HAL_OK) {
         my_printf("\rnewly bad %lu (flush erase)\r\n", phys);
         mark_bad_oob(phys); bad[phys] = 1; bad_new++;
         advance = 0;
      } else {
         int fail = 0;
         for (uint32_t pg = 0; pg < ppb && !fail; pg++)
            if (write_page(phys, pg, src + pg * hnand.Config.PageSize) != HAL_OK)
               fail = 1;
         if (fail) {
            my_printf("\rnewly bad %lu (flush write)\r\n", phys);
            mark_bad_oob(phys); bad[phys] = 1; bad_new++;
            advance = 0;
         } else {
            written++;
         }
      }

      phys++;
      if (advance) good_idx++;

      const uint32_t now = HAL_GetTick();
      if ((now - t_print) >= 2000U) {
         my_printf("\rblk %lu/%lu  ", good_idx, n);
         print_mbs(good_idx * BLOCK_BYTES, now - t0);
         my_printf("  (%lu written, %lu skipped)  ", written, skipped);
         t_print = now;
      }
   }

   fmc_flush_active = 0;
   const uint32_t elapsed = HAL_GetTick() - t0;
   my_printf("\r\ndone: %lu written, %lu skipped, %lu new-bad, %lu s, avg ",
             written, skipped, bad_new, elapsed / 1000U);
   print_mbs((written + skipped) * BLOCK_BYTES, elapsed);
   my_printf("\r\n");
}

void fmc_bload(int argc, uint32_t arg1, uint32_t arg2, uint32_t arg3)
{
   (void)argc; (void)arg1; (void)arg2; (void)arg3;
   if (!nand_ready) { my_printf("FMC: not initialised\r\n"); return; }

   /* Read partition table into buf_a. */
   const uint32_t pt_phys = lba_to_phys_block(NAND_BLOCK_PT);
   if (pt_phys == UINT32_MAX) {
      my_printf("bload: cannot find PT block\r\n");
      return;
   }
   if (read_block(pt_phys, buf_a) != HAL_OK) {
      my_printf("bload: PT read error\r\n");
      return;
   }

   const nand_pt_t *pt = (const nand_pt_t *)buf_a;
   if (pt->magic != NAND_PT_MAGIC) {
      my_printf("bload: bad PT magic 0x%08lx\r\n", (unsigned long)pt->magic);
      return;
   }
   uint32_t sum = 0;
   const uint8_t *pb = (const uint8_t *)pt;
   for (uint32_t i = 0; i < (uint32_t)offsetof(nand_pt_t, checksum); i++)
      sum += pb[i];
   if (sum != pt->checksum) {
      my_printf("bload: PT checksum mismatch\r\n");
      return;
   }

   /* Find kernel and dtb partitions. */
   const nand_part_t *kern_p = NULL;
   const nand_part_t *dtb_p  = NULL;
   for (uint32_t i = 0; i < pt->num_parts && i < NAND_PT_MAX_PARTS; i++) {
      if (strncmp(pt->parts[i].name, "kernel", 16) == 0)
         kern_p = &pt->parts[i];
      else if (strncmp(pt->parts[i].name, "dtb", 16) == 0)
         dtb_p = &pt->parts[i];
   }
   if (!kern_p) { my_printf("bload: no kernel partition\r\n"); return; }
   if (!dtb_p)  { my_printf("bload: no dtb partition\r\n");    return; }

   /* Load DTB. */
   my_printf("bload: DTB  blk %lu+%lu -> 0x%08lx\r\n",
             (unsigned long)dtb_p->start_block,
             (unsigned long)dtb_p->num_blocks,
             (unsigned long)DEF_DTB_ADDR);
   uint8_t * const dtb_dst = (uint8_t *)DEF_DTB_ADDR;
   for (uint32_t i = 0; i < dtb_p->num_blocks; i++) {
      const uint32_t phys = lba_to_phys_block(dtb_p->start_block + i);
      if (phys == UINT32_MAX) {
         my_printf("bload: DTB block %lu missing\r\n", (unsigned long)i);
         return;
      }
      if (read_block(phys, dtb_dst + i * BLOCK_BYTES) != HAL_OK) {
         my_printf("bload: DTB read error blk %lu\r\n", (unsigned long)i);
         return;
      }
   }

   /* Load kernel. */
   my_printf("bload: kernel blk %lu+%lu -> 0x%08lx\r\n",
             (unsigned long)kern_p->start_block,
             (unsigned long)kern_p->num_blocks,
             (unsigned long)DEF_LINUX_ADDR);
   uint8_t * const kern_dst = (uint8_t *)DEF_LINUX_ADDR;
   for (uint32_t i = 0; i < kern_p->num_blocks; i++) {
      const uint32_t phys = lba_to_phys_block(kern_p->start_block + i);
      if (phys == UINT32_MAX) {
         my_printf("bload: kernel block %lu missing\r\n", (unsigned long)i);
         return;
      }
      if (read_block(phys, kern_dst + i * BLOCK_BYTES) != HAL_OK) {
         my_printf("bload: kernel read error blk %lu\r\n", (unsigned long)i);
         return;
      }
   }

   my_printf("bload: done\r\n");
}

void fmc_load(int argc, uint32_t arg1, uint32_t arg2, uint32_t arg3)
{
   (void)arg2; (void)arg3;
   if (!nand_ready) { my_printf("FMC: not initialised\r\n"); return; }

   const uint32_t total    = hnand.Config.PlaneNbr * hnand.Config.PlaneSize;
   const uint32_t max_blks = FMC_DDR_BUF_SIZE / BLOCK_BYTES;
   const uint32_t n        = (argc >= 1 && arg1 > 0 && arg1 <= max_blks)
                             ? arg1 : max_blks;
   uint8_t * const ddr = (uint8_t *)FMC_DDR_BUF_ADDR;

   fmc_flush_active = 1;

   uint32_t rd_errs  = 0;
   uint32_t good_idx = 0;
   uint32_t phys     = 0;
   const uint32_t t0 = HAL_GetTick();
   uint32_t t_print  = t0;

