js216/stm32mp135-bootloader/src/fmc.c
   my_printf("FMC load: %lu blocks\r\n", n);

   while (good_idx < n && phys < total) {
      if (bad[phys]) { phys++; continue; }

      uint8_t * const dst = ddr + good_idx * BLOCK_BYTES;
      if (read_block(phys, dst) != HAL_OK)
         rd_errs++;

      good_idx++;
      phys++;

      const uint32_t now = HAL_GetTick();
      if ((now - t_print) >= 2000U) {
         my_printf("\rblk %lu/%lu  ", good_idx, n);
         print_mbs(good_idx * BLOCK_BYTES, now - t0);
         my_printf("  (%lu rd errs)  ", rd_errs);
         t_print = now;
      }
   }

   fmc_flush_active = 0;
   const uint32_t elapsed = HAL_GetTick() - t0;
   my_printf("\r\ndone: %lu rd errs, %lu s, avg ", rd_errs, elapsed / 1000U);
   print_mbs(n * BLOCK_BYTES, elapsed);
   my_printf("\r\n");
}

#else // NAND_FLASH

void fmc_init(int argc, uint32_t arg1, uint32_t arg2, uint32_t arg3)
{
   (void)argc; (void)arg1; (void)arg2; (void)arg3;
}

HAL_StatusTypeDef fmc_read_blocks(uint8_t *buf, uint32_t lba, uint32_t n)
{
   (void)buf; (void)lba; (void)n;
   return HAL_OK;
}

HAL_StatusTypeDef fmc_write_blocks(const uint8_t *buf, uint32_t lba, uint32_t n)
{
   (void)buf; (void)lba; (void)n;
   return HAL_OK;
}

uint32_t fmc_block_count(void) { return 0; }

void fmc_erase_all(int argc, uint32_t arg1, uint32_t arg2, uint32_t arg3)
{
   (void)argc; (void)arg1; (void)arg2; (void)arg3;
}

void fmc_test_boot(int argc, uint32_t arg1, uint32_t arg2, uint32_t arg3)
{
   (void)argc; (void)arg1; (void)arg2; (void)arg3;
}

void fmc_test_write(int argc, uint32_t arg1, uint32_t arg2, uint32_t arg3)
{
   (void)argc; (void)arg1; (void)arg2; (void)arg3;
}

void fmc_test_read(int argc, uint32_t arg1, uint32_t arg2, uint32_t arg3)
{
   (void)argc; (void)arg1; (void)arg2; (void)arg3;
}

void fmc_scan(int argc, uint32_t arg1, uint32_t arg2, uint32_t arg3)
{
   (void)argc; (void)arg1; (void)arg2; (void)arg3;
}

void fmc_flush(int argc, uint32_t arg1, uint32_t arg2, uint32_t arg3)
{
   (void)argc; (void)arg1; (void)arg2; (void)arg3;
}

void fmc_load(int argc, uint32_t arg1, uint32_t arg2, uint32_t arg3)
{
   (void)argc; (void)arg1; (void)arg2; (void)arg3;
}

void fmc_bload(int argc, uint32_t arg1, uint32_t arg2, uint32_t arg3)
{
   (void)argc; (void)arg1; (void)arg2; (void)arg3;
}

#endif // NAND_FLASH

// end file fmc.c
